package ru.job4j.oop;

public class Ball {
    public void tryEat(Ball ball){
        System.out.println("Не ешь меня! Я тебе песенку спою,\n" +
                "\n" +
                "— Я Колобок, Колобок!\n" +
                "\n" +
                "Я по коробу скребен,\n" +
                "\n" +
                "По сусеку метен,\n" +
                "\n" +
                "На сметане мешон,\n" +
                "\n" +
                "Да в масле пряжон,\n" +
                "\n" +
                "На окошке стужон;\n" +
                "\n" +
                "Я от дедушки ушел,\n" +
                "\n" +
                "Я от бабушки ушел,\n" +
                "\n" +
                "А от тебя и подавно уйду!");
    }
}
